keep_cols = ['account_nm', 'thstrm_amount', 'frmtrm_amount', 'bfefrmtrm_amount', 'sj_div']


financial_mapping = {
    "mappings": {
        "properties": {
            "corp_code": {"type": "keyword"},
            "account_nm": {"type": "keyword"},  # 계정명은 검색/집계용
            "thstrm_amount": {"type": "double"},  # 숫자형 금액
            "frmtrm_amount": {"type": "double"},
            "bfefrmtrm_amount": {"type": "double"},
            "sj_div": {"type": "keyword"}       # BS, IS 등 구분
        }
    }
}



ACCOUNT_MAP = {
    "매출액": [
        "수익(매출액)", "매출액", "매출", "영업수익", "매출수익",
        "총매출액", "순매출액",
        "상품매출액", "제품매출액", "용역매출액"
    ],

    "영업이익": [
        "영업이익", "영업손실", "영업이익(손실)", "영업손익",
        "영업활동이익"
    ],

    "당기순이익": [
        "당기순이익", "당기순손실", "당기순이익(손실)",
        "지배기업의소유주에게귀속되는당기순이익(손실)",
        "지배기업소유주지분순이익", "지배주주지분순이익",
        "순이익", "순손실",
        "계속영업당기순이익", "계속영업당기순손실", "계속영업이익(손실)",
        "연결당기순이익", "연결당기순이익(손실)",
        "당기순손익"
    ],

    "자산총계": [
        "자산총계", "총자산"
    ],

    "자본총계": [
        "자본총계", "총자본", "자본합계"
    ],

    "영업활동현금흐름": [
        "영업활동현금흐름", "영업활동순현금흐름",
        "영업활동으로인한현금흐름", "영업활동현금유입(유출)",
        "영업현금흐름"
    ],

    "투자활동현금흐름": [
        "투자활동현금흐름", "투자활동순현금흐름",
        "투자활동으로인한현금흐름", "투자활동현금유입(유출)",
        "투자현금흐름"
    ],

    "재무활동현금흐름": [
        "재무활동현금흐름", "재무활동순현금흐름",
        "재무활동으로인한현금흐름", "재무활동현금유입(유출)",
        "재무현금흐름"
    ]
}



STATEMENT_MAP = {
    "매출액": ["CIS", "IS"],
    "영업이익": ["CIS", "IS"],
    "당기순이익": ["CIS", "IS"],   # ← 여기서만 CIS 기준으로 제한
    "자산총계": ["BS"],
    "자본총계": ["BS"],
    "영업활동현금흐름": ["CF"],
    "투자활동현금흐름": ["CF"],
    "재무활동현금흐름": ["CF"]
}